Repository: glepore70/pronom-research
Catalog: sample_files/p/po/*.po
Languages: cs, fi, sk

source: Error
cs: Chyba
fi: Virhe
sk: Chyba

source: Could not open specified icon file
cs: Nelze otevøít specifikovaný soubor s ikonou
fi: M‰‰ritellyn kuvaketiedoston avaus ei onnistunut
sk: Nemo¾no otvori» daný súbor s ikonou

source: will be forcibly closed. Any unsaved changes will be lost. Please confirm.
cs: bude násilnì ukonèen. Jakékoli zmìny budou ztraceny. Potvrïte prosím.
fi: suljetaan v‰kisin. Kaikki tallentamattomat muutokset katoavat. Vahvista.
sk: bude nútene ukonèená. V¹etky neulo¾ené zmeny sa stratia. Prosím, potvrïte.

source: Kill Application
cs: Ukonèit aplikaci
fi: Tapa sovellus
sk: Zabi» aplikáciu

source: Yes
cs: Ano
fi: Kyll‰
sk: Áno

source: No
cs: Ne
fi: Ei
sk: Nie

source: Unhide Here
cs: Odkrýt zde
fi: Tuo n‰kyviin t‰‰ll‰
sk: Odhali» tu

source: Hide
cs: Skrýt
fi: Piilota
sk: Skry»

source: Set Icon...
cs: Nastavit ikonu...
fi: Valitse kuvake...
sk: Zmeni» ikonu...

source: Kill
cs: Ukonèit
fi: Tapa
sk: Zabi»

source: Unhide
cs: Odkrýt
fi: Tuo n‰kyviin
sk: Odhali»

source: recreating missing icon '%s'
cs: znovu vytvoøit chybìjící ikonu '%s'
sk: znovu sa vytvára chýbajúca ikona '%s'

source: could not read domain "%s" from defaults database
cs: z databáze standardù nelze naèíst doménu "%s"
fi: tiedon "%s" luku oletustietokannasta ei onnistunut
sk: nemo¾no naèíta» doménu "%s" z databázy implicitných nastavení

source: Domain %s (%s) of defaults database is corrupted!
cs: V databázi standardù je po¹kozena doména %s (%s)!
fi: Oletustietokannan kentt‰ %s (%s) on vioittunut!
sk: Doména %s (%s) v databáze implicitných nastavení je po¹kodená!

source: could not load domain %s from user defaults database
cs: z u¾ivatelovy databáze standardù nelze naèíst doménu "%s"
fi: arvon %s lataaminen k‰ytt‰j‰n oletustietokannasta ei onnistu
sk: nemo¾no naèíta» doménu %s z u¾ivateµskej databázy implicitných nastavení

source: Domain %s (%s) of global defaults database is corrupted!
cs: V globální databázi standardù je po¹kozena doména %s (%s)
fi: Globaalin oletustietokannan arvo %s (%s) on vioittunut!
sk: Doména %s (%s) v globálnej databáze implicitných nastavení je po¹kodená!

source: could not load domain %s from global defaults database (%s)
cs: nelze naèíst doménu %s z globální databáze standardù (%s)
fi: arvon %s lataus globaalista oletustietokannasta (%s) ei onnistu
sk: nemo¾no naèíta» doménu %s z globálnej databázy implicitných nastavení (%s)

source: could not load domain %s from global defaults database
cs: z globální databáze standardù nelze naèíst doménu "%s"
fi: arvon %s lataus globaalista oletustietokannasta ei onnistu
sk: nemo¾no naèíta» doménu %s z globálnej databázy implicitných nastavení

source: could not load logo image for panels: %s
cs: pro panely nelze naèíst logo: %s
fi: paneelien %s logo-kuvaa ei voitu ladata
sk: nemo¾no naèíta» obrázok s logom pre panely: %s

source: wrong option value for key "%s". Should be one of %s
cs: Chybný formát volby pro klíè "%s". Má být jeden z %s
fi: avaimella "%s" on v‰‰r‰ optioarvo. Pit‰isi olla joku n‰ist‰: %s
sk: chybná hodnota kµúèa "%s". Má bý» jedna z %s

source: can't convert "%s" to boolean for key "%s"
cs: "%s" nelze zkonvertovat pro klíè "%s" na boolean
fi: "%s":n muunto boolean-muotoon avaimelle "%s" ei onnistu
sk: nemo¾no previes» "%s" na boolean pre kµúè "%s"

source: using default "%s" instead
cs: namísto toho pou¾iji implicitní %s
fi: k‰ytet‰‰n sen sijaan oletusarvoa "%s"
sk: pou¾itá implicitná "%s"

source: can't convert "%s" to integer for key "%s"
cs: "%s" nelze zkonvertovat pro klíè "%s" na integer
fi: "%s":n muuntaminen kokonaisluvuksi avaimelle "%s" ei onnistu
sk: nemo¾no previes» "%s" na integer pre kµúè "%s"

source: Wrong option format for key "%s". Should be %s.
cs: Chybný formát volby pro klíè "%s". Má být %s.
fi: Avaimella "%s" on v‰‰r‰ optiomuoto. Pit‰isi olla %s.
sk: Chybný formát voµby kµúèa "%s". Má by» %s.

source: Incorrect number of elements in array for key "%s".
cs: Pro klíè %s je v poli chybný poèet prvkù.
fi: Taulukossa on v‰‰r‰ m‰‰r‰ alkioita avaimelle "%s".
sk: Nesprávny poèet prvkov v poli kµúèa "%s".

source: Wrong value for key "%s". Should be Coordinate.
cs: Chybná hodnota pro klíè "%s". Má být Coordinate.
fi: Avaimella "%s" on v‰‰r‰ arvo. Pit‰isi olla koordinaatti.
sk: Chybná hodnota kµúèa "%s". Má by» Coordinate.

source: can't convert array to integers for "%s".
cs: pole nelze konvertovat na èísla typu integer(pro %s).
fi: taulukkoa ei voida muuntaa kokonaisluvuiksi "%s":lle.
sk: nemo¾no previes» pole integery pre "%s".

source: "%s" is not a valid color name
cs: "%s" není správné jméno barvy
fi: "%s" ei ole sallittu v‰rin nimi
sk: "%s" nie je akceptovateµné meno farby

source: bad number of arguments in gradient specification
cs: chybný poèet argumentù ve specifikaci gradientu
fi: virheellinen m‰‰r‰ argumentteja liukuv‰rin m‰‰ritelm‰ss‰
sk: chybný poèet argumetov v definícii prechodu farieb

source: too few arguments in multicolor gradient specification
cs: nedostatek argumentù pøi specifikaci vícebarevného gradientu
fi: liian v‰h‰n argumentteja moniv‰risen liukuv‰rin m‰‰ritelm‰ss‰
sk: nedostatok argumentov v definícii prechodu viacerých farieb

source: bad number of arguments in textured gradient specification
cs: chybný poèet argumentù ve specifikaci texturovaného gradientu
fi: virheellinen m‰‰r‰ argumentteja liukuv‰ritetyn kuvion m‰‰ritelm‰ss‰
sk: chybný poèet argumetov v definícii prechodu textúr

source: bad opacity value for tgradient texture "%s". Should be [0..255]
cs: chybná hodnota neprùhlednosti pro texturu tgradient "%s". Má být [0..255]
fi: v‰‰r‰ peitt‰vyysarvo kuvioliukuv‰rille "%s". Pit‰isi olla [0..255]
sk: chybná hodnota nepriehµadnosti pre textúry prechodu "%s". Má by» [0..255]

source: could not initialize library %s
cs: nelze inicializovat knihovnu %s
fi: kirjaston %s alustus ep‰onnistui
sk: nemo¾no inicializova» kni¾nicu %s

source: could not find function %s::%s
cs: nelze najít funkci %s::%s
fi: funktiota %s::%s ei lˆydy
sk: nemo¾no nájs» funkciu %s::%s

source: invalid texture type %s
cs: chybný typ textury %s
fi: virheellinen kuviotyyppi %s
sk: chybný typ textúry %s

source: Error in texture specification for key "%s"
cs: Chyba ve specifikaci textury pro klíè "%s"
fi: Virhe kuviom‰‰ritelm‰ss‰ avaimelle "%s"
sk: Chyba v definícii textúry kµúèa "%s"

source: Wrong type for workspace background. Should be a texture type.
cs: Chybný typ pro pozadí pracovní plochy. Má být textura.
fi: V‰‰r‰ tyyppi tyˆtilan taustakuvaksi. Pit‰isi olla kuviotyyppi.
sk: Chybný typ pozadia pracovnej plochy. Má by» textúra.

source: Wrong type for background of workspace %i. Should be a texture.
cs: Chybný typ pro pozadí pracovní plochy %i. Má být textura.
fi: V‰‰r‰ tyyppi tyˆtilan %i taustakuvaksi. Pit‰isi olla kuvio.
sk: Chybný typ pozadia pracovnej plochy %i. Má by» textúra.

source: could not load any usable font!!!
cs: nelze naèíst ¾ádný pou¾itelný font!!!
fi: mink‰‰n k‰yttˆkelpoisen fontin lataaminen ei onnistunut!!!
sk: nemo¾no naèíta» ¾iadny pou¾iteµný font!!!

source: could not get color for key "%s"
cs: nelze získat barvu pro klíè "%s"
fi: en lˆyt‰nyt avainta "%s" vastaavaa v‰ri‰
sk: nemo¾no získa» farbu kµúèa "%s"

source: %s:invalid key modifier "%s"
cs: %s:chybný modifikátor klávesy "%s"
fi: %s: virheellinen avainm‰‰re "%s"
sk: %s:chybný klávesový modifikátor "%s"

source: %s:invalid kbd shortcut specification "%s"
cs: %s:chybná specifikace klávesové zkratky "%s"
fi: %s: virheellinen n‰pp‰inpikavalinnan m‰‰rittely "%s"
sk: %s:chybná definícia klávesovej skratky "%s"

source: %s:invalid key in shortcut "%s"
cs: %s:chybná klávesa v klávesové zkratce "%s"
fi: %s: ep‰kelpo n‰pp‰in pikavalinnassa "%s"
sk: %s:nesprávna klávesa v klávesovej skratke "%s"

source: %s: modifier key %s is not valid
cs: %s: klávesa modifikátoru %s není v poøádku
fi: %s: muunnosn‰pp‰in %s ei ole voimassa
sk: %s: nesprávny klávesový modifikátor %s

source: could not load image in option %s: %s
cs: nelze naèíst obrázek ve volbì %s: %s
fi: optioon %s: %s liittyv‰n kuvan lataus ei onnistunut
sk: nemo¾no naèíta» obrázok vo voµbe %s: %s

source: failed to open bitmap file "%s"
cs: nelze otevøít soubor s obr8zkem "%s"
fi: bittikarttatiedoston "%s" lataus ep‰onnistui
sk: nepodarilo sa otvori» bitmapový súbor "%s"

source: "%s" is not a valid bitmap file
cs: "%s" není platný soubor barvy
fi: "%s" ei ole kelvollinen bittikarttatiedosto
sk: "%s" nie je podporovaný bitmapový súbor

source: out of memory reading bitmap file "%s"
cs: nedostatek pamìti pøi otvírání obrázku "%s"
fi: muisti loppui luettaessa bittikarttatiedostoa "%s"
sk: nedostatok pamäti pre naèítanie bitmapového súboru "%s"

source: bad number of arguments in cursor specification
cs: chybný poèet argumentù ve specifikaci kursoru
fi: kohdistinm‰‰ritelm‰ss‰ on virheellinen m‰‰r‰ argumentteja
sk: chybný poèet argumetov v ¹pecifikácii kurzoru

source: unknown builtin cursor name "%s"
cs: neznámý interní název kursoru "%s"
fi: tuntematon sis‰‰nrakennettu kohdistinnimi "%s"
sk: neznáme meno vstavaného kurzoru "%s"

source: could not find cursor bitmap file "%s"
cs: nelze nalézt soubor s kurzorem "%s"
fi: kohdistinbittikarttatiedostoa "%s" ei lˆytynyt
sk: nemo¾no nájs» súbor s kurzorom "%s"

source: Error in cursor specification for key "%s"
cs: Chyba ve specifikaci kurzoru pro klíè "%s"
fi: Virhe avaimen "%s" kohdistinm‰‰ritelm‰ss‰
sk: Chyba v definícii kurzoru pre kµúè "%s"

source: could not render texture for icon background
cs: pro pozadí ikony nelze vykreslit texturu
fi: kuvion piirto kuvakkeen taustalle ei onnistu
sk: nemo¾no renderova» textúru pozadia ikon

source: Save workspace state
sk: Ulo¾i» stav pracovných plôch

source: Cancel
cs: Zru¹it
fi: Peruuta
sk: Zru¹i»

source: Could not open directory
cs: Nelze otevøít adresáø
fi: Ei voi avata hakemistoa
sk: Nemo¾no otvori» adresár

source: Could not load image file
cs: Nelze naèíst obrázek
fi: Ei voi avata kuvatiedostoa
sk: Nemo¾no naèíta» súbor s obrázkom

source: Directories
cs: Adresáøe
fi: Hakemistot
sk: Adresáre

source: Icons
cs: Ikony
fi: Kuvakkeet
sk: Ikony

source: Preview
fi: Esikatselu
sk: Náhµad

source: File Name:
cs: Soubor:
fi: Tiedosto:
sk: Súbor:

source: Choose File
cs: Vyberte soubor
fi: Valitse tiedosto
sk: Vyberte súbor

source: Icon Chooser
cs: Výbìr ikony
fi: Kuvakkeen valitsin
sk: Výber ikony

source: Version %s
cs: Verze %s
fi: Versio %s
sk: Verzia %s

source: Window Manager for X
cs: Okenní mana¾er pro X
fi: Ikkunamanageri X:‰‰n
sk: Mana¾ér okien pre X

source: Using visual 0x%x: %s %ibpp
cs: Grafika pou¾ívá 0x%x: %s %ibpp
sk: Re¾im zobrazenia 0x%x: %s %ibpp

source: (32 thousand colors)
cs: (32 tisíc barev)
fi: (32 000 v‰ri‰)
sk: (32 tisíc farieb)

source: (64 thousand colors)
cs: (64 tisíc barev)
fi: (64 000 v‰ri‰)
sk: (64 tisíc farieb)

source: (16 million colors)
cs: (16 milionù barev)
fi: (16 miljoonaa v‰ri‰)
sk: (16 miliónov farieb)

source: (%d colors)
cs: (%d barev)
fi: (%d v‰ri‰)
sk: (%d farby)

source: Total allocated memory: %i kB. Total memory in use: %i kB.
cs: Pøidìlená pamì»: %i kB. Pou¾ívaná pamì»: %i kB.
fi: Muistia varattu yhteens‰ %i kt. Muistia k‰ytˆss‰ yhteens‰ %i kt.
sk: Alokovaná pamä» spolu: %i kB. Vyu¾ívaná pamä» spolu: %i kB.

source: Supported image formats:
cs: Podporované formáty obrázkù:
fi: Tuetut kuvamuodot:
sk: Podpora grafických formátov:

source: Additional support for:
cs: Dodateèná podpora pro:
sk: Ïal¹ia podpora pre:

source: and
cs: a
fi: ja
sk: a

source: Sound disabled
cs: Zvuk zakázán
fi: ƒ‰ni pois
sk: Zvuk vypnutý

source: Sound enabled
cs: Zvuk povolen
fi: ƒ‰ni p‰‰ll‰
sk: Zvuk povolený

source: Merry X'mas!
cs: Veselé vánose!
sk: ©»astné a veselé!

source: Window Maker is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. Window Maker is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.
cs: Window Maker je volnì ¹iøitelný software; mù¾ete ho pøedat dál nebo upravit podle podmínek GNU licence (Genral Public Licence), která byla uveøejnìna organizací Free Software Foundation; jedna ze dvou verzí licence, nebo (jestli chcete) nìjaká novìj¹í verze. Window Maker je ¹íøen s nadìjí, ¾e bude pou¾itelný, ale BEZ JAKÉKOLIV ZÁRUKY; bez pozdìji pøidaných záruk OBCHODNÍKA nebo DOBØE MÍNÌNÉHO ÚMYSLU. Více informací naleznete v GNU licenci (Genral Public Licence) Mìli by jste obdr¾et kopii GNU licence s tímto programem; pokud tomu tak není napi¹te organizaci Free Software Foundation: Inc., 59 Temple Place - Suite 330, Boston MA, 02111-1307, USA
fi: Window Maker on vapaa ohjelmisto; voit jakaa sit‰ edelleen ja/tai muokata sit‰ Free Software Foundationin julkaiseman GNU General Public Licensen (version 2 tai halutessasi jonkin myˆhemm‰n version) ehtojen mukaisesti. Window Makeria jaetaan siin‰ toivossa, ett‰ siit‰ on hyˆty‰, mutta ILMAN MITƒƒN TAKUUTA; siihen ei sis‰lly edes ep‰suoraa takuuta siit‰, ett‰ se SOVELTUISI MARKKINOITAVAKSI tai SOPISI JOHONKIN TIETTYYN TARKOITUKSEEN. Katso tarkempia tietoja GNU General Public Licensest‰. T‰m‰n ohjelman mukana pit‰isi tulla kopio GNU General Public Licensest‰. Jos n‰in ei ole, ilmoita siit‰ osoitteeseen Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.
sk: Tento program je free software; mô¾ete ho roz¹irova» a/alebo modifikova» v súlade s GNU General Public License, ktorú publikuje Free Software Foundation; buï verziou 2 licencie, alebo ktoroukoµvek neskor¹ou verziou. Tento program je roz¹irovaný vo viere, ¾e bude u¾itoèný, ale bez AKEJKO¥VEK ZÁRUKY; aj bez záruky PREDAJNOSTI alebo SPÔSOBILOSTI PRE DANÝ CIE¥. Pre bli¾¹ie informácie viï GNU General Public License Kópiu GNU General Public License by ste mali obdr¾a» spolu s týmto programom; ak nie, pí¹te na Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.

source: cannot open connection for crashing dialog panel. Aborting.
cs: pro nefunkèní dialogový panel nelze otevøít spojení. Konec.
fi: yhteyden avaus kaatumis-valintapaneeliin ei onnistunut. Keskeytet‰‰n.
sk: nemo¾no otvori» spojenie pre padajúci dialógový panel. Ukonèené.

source: Fatal error
cs: Záva¾ná chyba
fi: Vakava virhe
sk: Fatálna chyba

source: Window Maker received signal %i (%s).
cs: Window Maker obdr¾el signál %i (%s).
fi: Window Maker vastaanotti signaalin %i (%s).
sk: Window Maker prijal signál %i (%s).

source: Window Maker received signal %i.
cs: Window Maker pøijal signál %i.
fi: Window Maker vastaanotti signaalin %i.
sk: Window Maker prijal signál %i.

source: This fatal error occured probably due to a bug. Please fill the included BUGFORM and report it to bugs@windowmaker.org.
cs: Tato záva¾ná chyba se vyskytla pravdìpodobnì v dùsledku chyby v kódu Window Makeru. Prosím, vyplòte soubor BUGFORM a za¹lete ho na bugs@windowmaker.org (pouze anglicky)
fi: T‰m‰ vakava virhe tapahtui luultavasti bugin johdosta. Ole hyv‰ ja t‰yt‰ oheinen bugi-kaavake ja l‰het‰ se osoitteeseen bugs@windowmaker.org.
sk: Táto fatálna chyba sa vyskytla pravdepodobne kvôli chybe vo Window Makery. Prosím vyplòte prilo¾ený BUGFORM a po¹lite ho na bugs@windowmaker.org.

source: What do you want to do now?
cs: Co byste chtìl(a) udìlat teï ?
fi: Mit‰ haluat nyt tehd‰?
sk: Èo chcete urobi»?

source: Select action
cs: Oznaèit ikonu
fi: Valitse toiminta
sk: Vyberte èinnos»

source: Abort and leave a core file
cs: Ukonèi a zapsat soubor s obsahem pamìti (core)
fi: Keskeyt‰ ja kirjoita core-tiedosto
sk: Skonèi» a vytvori» súbor core

source: Restart Window Maker
cs: Restart Window Makeru
fi: K‰ynnist‰ Window Maker uudelleen
sk: Re¹tartova» Window Maker

source: Start alternate window manager
cs: Odstartovat alternativní okenní mana¾er
fi: K‰ynnist‰ vaihtoehtoinen ikkunamanageri
sk: Spusti» alternatívny mana¾ér okien

source: Window Maker is part of the GNUstep project. The GNUstep project aims to create a free implementation of the OpenStep(tm) specification which is a object-oriented framework for creating advanced graphical, multi-platform applications. Additionally, a development and user desktop enviroment will be created on top of the framework. For more information about GNUstep, please visit: www.gnustep.org
cs: Window maker je souèástí GNUstep projektu. GNUstep usiluje o vytvoøení volnì ¹iøitelné implementace prostøedí OpenStepu(tm), které má objektovì orientovaný systém pro vytváøení pokroèilých grafických, multiplatformních aplikací. A navíc vývoj u¾ivatelsky pøívìtivého prostøedí je nejdùle¾itìj¹í souèást projektu. Více informací o GNUstepu naleznete na webové stránce: www.gnustep.org
fi: Window Maker on osa GNUstep-projektia. GNUstep-projektin tarkoituksena on luoda vapaa toteutus OpenStep(tm)-m‰‰rittelyst‰, joka on olio-orientoitunut kehys kehittyneiden graafisten, monilla alustoilla toimivien sovellusten luontiin. Kehyksen p‰‰lle tullaan lis‰ksi luomaan kehitys- ja k‰ytt‰j‰tyˆpˆyt‰- ymp‰ristˆ. Saat GNUstepist‰ lis‰‰ tietoa osoitteesta www.gnustep.org
sk: Window Maker je súèas»ou projektu GNUstep. Cieµom projektu GNUstep je vytvori» free implementáciu ¹pecifikácie OpenStep(tm), èo je objektovo orientovaný základ pre tvorbu pokroèilých, multiplatformových aplikácií. Navy¹e, na tomto základe bude postavené vývojové a u¾ívateµské prostredie. Viac informácií o projekte GNUstep mo¾no získa» na adrese www.gnustep.org

source: About GNUstep
cs: O GNUstepu
fi: Tietoa GNUstepist‰
sk: O projekte GNUstep

source: Type the name for workspace %i:
cs: Zadejte jméno pro plochu %i:
fi: Kirjoita nimi tyˆtilalle %i:
sk: Zadajte meno pre pracovnú plochu %i:

source: Rename Workspace
cs: Pøejmenovat plochu
fi: Vaihda tyˆtilan nimi
sk: Premenova» plochu

source: Warning
cs: Varování
fi: Varoitus
sk: Varovanie

source: Some icons cannot be made omnipresent. Please make sure that no other icon is docked in the same positions on the other workspaces and the Clip is not full in some workspace.
cs: Nìkteré ikony nemohou být v¹udypøítomné. Ujistìte se prosím, ¾e ¾ádná dal¹í ikona není ukotvena na stejné pozici v ostatních pracovních plochách a ¾e Sponka není na nìkteré plo¹e zaplnìna.
fi: Er‰it‰ kuvakkeita saada kaikkialla n‰kyviksi. Varmista, ettei toisia ikoneita ole telakoitu samoihin paikkoihin muissa tyˆtiloissa ja ettei Liitin ole t‰ynn‰ jossain tyˆtilassa.
sk: Niektoré ikony nemô¾u by» umiestnené na v¹etkých plochách. Ubezpeète sa, ¾e iné ikony nie sú umiestnené v rovnakej pozícii na ostatných plochách a Spinka nie je na ¾iadnej ploche zaplnená.

source: Icon cannot be made omnipresent. Please make sure that no other icon is docked in the same position on the other workspaces and the Clip is not full in some workspace.
cs: Nìkteré ikony nemohou být v¹udypøítomné. Ujistìte se prosím, ¾e ¾ádná dal¹í ikona není ukotvena na stejné pozici v ostatních pracovních plochách a ¾e Sponka není na nìkteré plo¹e zaplnìna.
fi: Kuvaketta ei saada kaikkialla n‰kyv‰ksi. Varmista, ettei toista ikonia ole telakoitu samaan kohtaan muissa tyˆtiloissa ja ettei Liitin ole t‰ynn‰ jossain tyˆtilassa.
sk: Ikona nemô¾e by» umiestòená na v¹etkých plochách. Ubezpeète sa, ¾e iné ikony nie sú umiestnené v rovnakej pozícii na ostatných plochách a Spinka nie je na ¾iadnej ploche zaplnená.

source: Workspace Clip
cs: Sponka
fi: Tyˆtilan Liitin
sk: Spinka

source: All selected icons will be removed!
cs: V¹echny vybrané ikony budou odstranìny!
fi: Kaikki valitut kuvakkeet poistetaan!
sk: V¹etky oznaèené ikony budú odstránené!

source: Keep Icon
cs: Dr¾et ikonu
fi: Pid‰ kuvake
sk: Ponecha» ikonu

source: Type the command used to launch the application
cs: Zadejte pøíkaz, který spustí aplikaci
fi: Kirjoita komento, jolla ohjelma k‰ynnistet‰‰n
sk: Zadajte príkaz, ktorý spustí aplikáciu

source: could not launch application %s
cs: aplikaci %s nelze odstartovat
fi: sovelluksen %s k‰ynnistys ei onnistu
sk: nemo¾no spusti» aplikáciu %s

source: could not create workspace submenu for Clip menu
cs: nelze vytvoøit submenu pracovní plochy pro menu Sponky
fi: Liittimen valikkoon ei voitu luoda tyˆtila-alivalikkoa
sk: v menu Spinky nemo¾no vytvori» submenu pracovnej plochy

source: could not create options submenu for Clip menu
cs: nelze vytvoøit submenu voleb pro menu Sponky
fi: Liittimen valikkoon ei voitu luoda asetukset-alivalikkoa
sk: v menu Spinky nemo¾no vytvori» submenu volieb

source: Keep on Top
cs: V¾dy navrchu
fi: Pid‰ p‰‰llimm‰isen‰
sk: V¾dy navrchu

source: Collapsed
cs: Svinuto
fi: H‰ivytetty
sk: Zvinuté

source: Autocollapse
cs: Automaticky svinout
fi: Automaattinen h‰ivytys
sk: Automaticky zvinú»

source: Autoraise
cs: Automaticky Nahoru/Dolù
fi: Nosta automaattisesti
sk: Auto navrchu/naspodu

source: Autoattract Icons
cs: Automaticky chytat ikony
fi: Ker‰‰ kuvakkeet automaattisesti
sk: V¾dy pritiahnu» ikony

source: Clip Options
cs: Volby Sponky
fi: Liittimen asetukset
sk: Voµby Spinky

source: Selected
cs: Vybraná
fi: Valittu
sk: Vybraná

source: Select All Icons
cs: (Od)Oznaèit v¹echny ikony
fi: Valitse kaikki kuvakkeet
sk: Vybra» v¹etky ikony

source: Move Icon To
cs: Pøesunout ikonu na
fi: Siirr‰ kuvake tilaan
sk: Presunú» ikonu na

source: Remove Icon
cs: Odstranit ikonu
fi: Poista kuvake
sk: Odstráni» ikonu

source: Attract Icons
cs: Chytat ikony
fi: Ker‰‰ kuvakkeet
sk: Pritiahnu» ikony

source: Launch
cs: Odstartovat
fi: K‰ynnist‰
sk: Spusti»

source: Settings...
cs: Nastavení...
fi: Asetukset...
sk: Nastavenia...

source: bad value in docked icon state info %s
cs: chybná hodnota stavu ukotvené ikony %s
fi: virheellinen arvo telakoidun kuvakkeen tilatiedossa %s
sk: chybná hodnota v informácii o stave ukotvenej ikony %s

source: bad value in docked icon position %i,%i
cs: chybná hodnota pozice ukotvené ikony %i,%i
fi: virheellinen arvo telakoidun kuvakkeen paikassa %i,%i
sk: chybná hodnota umiestnenia ukotvenej ikony %i,%i

source: there are too many icons stored in dock. Ignoring what doesn't fit
cs: v doku je pøíli¹ mnoho ikon. Co se nevejde, je zanedbáno
fi: Telakassa on liikaa kuvakkeita. J‰t‰n huomiotta ne, jotka eiv‰t mahdu.
sk: v Doku je príli¹ veµa ikon. Prebytoèné budú ignorované.

source: Dock Icon
cs: Ukotvit ikonu
fi: Telakoi kuvake
sk: Ukotvi» ikonu

source: Could not execute command "%s"
cs: Nelze provést pøíkaz "%s"
fi: Komennon "%s" suoritus ei onnistunut
sk: Nemo¾no vykona» príkaz "%s"

source: Toggle Omnipresent
cs: V¹echny plochy
fi: N‰kyvyys kaikkialla p‰‰lle/pois
sk: Prepnú» Na v¹etkých plochách

source: Omnipresent
cs: V¹echny plochy
fi: N‰kyviss‰ kaikkialla
sk: Na v¹etkých plochách

source: Unselect All Icons
cs: (Od)Oznaèit v¹echny ikony
fi: Kaikkien kuvakkeiden valinta pois
sk: Odznaèit v¹etky ikony

source: Keep Icons
cs: Dr¾et ikonu
fi: Pid‰ kuvakkeet
sk: Ponecha» ikony

source: Move Icons To
cs: Pøesunout ikonu(y) na
fi: Siirr‰ kuvakkeet ->
sk: Presunú» ikony na

source: Remove Icons
cs: Odstranit ikonu(y)
fi: Poista kuvakkeet
sk: Odstráni» ikony

source: Bring Here
cs: Dr¾et zde
fi: Tuo t‰nne
sk: Prenies» sem

source: could not find icon %s, used in a docked application
cs: nelze najít ikonu %s, která byla pou¾ita pro aplikaci v doku
fi: telakoidussa sovelluksessa k‰ytett‰v‰‰ kuvaketta %s ei lˆydy
sk: nemô¾no nájs» ikonu %s ukotvenej aplikácie

source: Could not open specified icon file: %s
cs: Nelze otevøít specifikovaný soubor s ikonou: %s
fi: M‰‰ritellyn kuvaketiedoston %s avaus ei onnistu
sk: Nemô¾no otvori» daný súbor s ikonou: %s

source: Ignore
cs: Ignorovat
fi: J‰t‰ huomiotta
sk: Ignorova»
