Repository: glepore70/pronom-research
Catalog: sample_files/p/po/*.po
Languages: cs, fi, sk

source: Start when Window Maker is started
cs: Odstartovat pøi startu Window Makeru
fi: K‰ynnist‰, kun WMaker k‰ynnistet‰‰n
sk: Spusti» pri ¹tarte WindowMakeru

source: Lock (prevent accidental removal)
cs: Zamknout (pøed náhodným odstranìním)
fi: Lukitse (est‰ tahaton poisto)
sk: Chráni» pred náhodným odstránením

source: Application path and arguments
cs: Cesty a argumenty pro aplikaci
fi: Sovelluksen polku ja argumentit
sk: Umiestnenie a argumenty aplikácie

source: Command for middle-click launch
cs: Pøíkaz pro prostøední tlaèítko
sk: Príkaz pre stredné tlaèítko

source: %s will be replaced with current selection
cs: %s bude nahrazeno aktuálním výbìrem
sk: %s sa nahradí aktuálnym výberom

source: Command for files dropped with DND
cs: Pøíkaz pro polo¾ený soubor (DND)
fi: Komento tiedostoille, jotka vedet‰‰n ja tiputetaan
sk: Príkaz pre polo¾ené súbory (DND)

source: %d will be replaced with the file name
cs: %d bude nahrazeno jménem souboru
fi: %d korvataan tiedoston nimell‰
sk: %d sa nahradí menom súboru

source: DND support was not compiled in
cs: DND podpora nebylo zakompilována
fi: ved‰ ja tiputa -tukea ei k‰‰nnetty mukaan
sk: Podpora DND nebola skompilovaná

source: Icon Image
cs: Ikona
fi: Kuvake
sk: Ikona

source: Browse...
cs: Hledat...
fi: Selaa...
sk: Hµada»...

source: Docked Application Settings
cs: Nastavení pro aplikaci v doku
fi: Telakoidun ohjelman asetukset
sk: Nastavenia aplikácie v Doku

source: could not render texture: %s
cs: nelze vykreslit texturu: %s
fi: kuviota %s ei voitu piirt‰‰
sk: nemo¾no renderova» textúru: %s

source: error rendering image:%s
cs: nelze vykreslit obrázek:%s
fi: virhe piirrett‰ess‰ kuvaa:%s
sk: chyba pri renderovaní obrázku:%s

source: error rendering image: %s
cs: chyba pøi vykreslení obrázku: %s
fi: virhe piirrett‰ess‰ kuvaa: %s
sk: chyba pri renderovaní obrázku: %s

source: out of memory while updating GNOME hints
cs: nedostatek pamìti pøi obnovování pokynù pro GNOME
sk: nedostatok pamäti pri obnovovaní príznakov GNOME

source: error loading image file "%s"
cs: ze souboru "%s" nelze naèíst obrázek
fi: virhe ladattaessa kuvaa "%s"
sk: chyba pri èítaní obrázku zo súboru "%s"

source: could not create directory %s
cs: Nelze vytvoøit adresáø %s
fi: hakemiston %s luonti ei onnistunut
sk: nemo¾no vytvori» adresár %s

source: could not find default icon "%s"
cs: nelze najít standardní ikonu "%s"
fi: Oletuskuvaketta "%s" ei lˆydy
sk: nemo¾no nájs» implicitnú ikonu "%s"

source: could not load default icon "%s":%s
cs: nelze naèíst standardní ikonu "%s":%s
fi: oletuskuvakkeen "%s":%s lataus ei onnistu
sk: nemo¾no naèíta» implicitnú ikonu "%s":%s

source: Maximize
cs: Maximalizace
fi: Suurenna
sk: Maximalizova»

source: Unmaximize
cs: Demaximalizace
fi: Peruuta suurennus
sk: Demaximalizova»

source: Miniaturize
cs: Miniaturizace
fi: Pienenn‰
sk: Minimalizova»

source: Deminiaturize
cs: Deminiaturizace
fi: Peruuta pienennys
sk: Deminimalizova»

source: Not Omnipresent
cs: Není v¹udypøítomný
sk: Nie na v¹etkých plochách

source: Move
cs: Pøesun
sk: Presunú»

source: Resize
cs: Zvìt¹it/Zmen¹it
sk: Veµkos»

source: Close
cs: Uzavøít
fi: Sulje
sk: Zatvori»

source: Move To
cs: Pøesunout na
fi: Siirr‰ tyˆtilaan
sk: Premiestni» na

source: %a(Run Command,Type the command to run:)
cs: %a(Spus» Pøikaz,Napi¹ pøíkaz ke spu¹tìní:)
sk: %a(Spusti»,Zadajte príkaz:)

source: failed to restart Window Maker.
cs: restart Window Makeru selhal.
fi: Window Makerin uudelleenk‰ynnistys ep‰onnistui.
sk: nepodarilo sa re¹tartova» Window Maker.

source: could not exec %s
cs: nelze spustit: %s
fi: %s:n suoritus ei onnistunut
sk: nemo¾no vykona» %s

source: Could not execute command:
cs: Nelze provést pøíkaz:
fi: Seuraavan komennon suoritus ep‰onnistui:
sk: Nemo¾no vykona» príkaz:

source: %s aborted.
cs: %s pøeru¹en.
fi: %s keskeytetty.
sk: %s zru¹ený.

source: Usage: %s [options]
cs: Pou¾ití: %s [volby]
fi: k‰yttˆ: %s [optiot]
sk: Pou¾itie: %s [voµby]

source: The Window Maker window manager for the X window system
cs: Správce oken Window Maker pro X window
fi: Window Maker -ikkunamanageri X-ikkunointij‰rjestelm‰lle
sk: Správca okien Window Maker pre X window system

source: -display host:dpy display to use
cs: -display host:dpy který display pou¾ít
fi: -display host:dpy k‰ytett‰v‰ n‰yttˆ
sk: -display host:dpy pou¾i» daný display

source: --no-cpp disable preprocessing of configuration files
cs: --nocpp neprovádìj pøedzpracování konfiguraèních souborù
fi: --no-cpp konfiguraatiotiedostojen esiprosessointi pois k‰ytˆst‰
sk: --no-cpp zakáza» preprocessing konfiguraèných súborov

source: --no-dock do not open the application Dock
cs: --nodock nezobrazuj Dok pro ikony
fi: --no-dock ‰l‰ avaa sovellustelakkaa
sk: --no-dock neotvára» Dok aplikácií

source: --no-clip do not open the workspace Clip
cs: --noclip neotvírat aplikaci Sponku
fi: --no-clip ‰l‰ avaa tyˆtilaliitint‰
sk: --no-clip neotvára» Spinku pracovných plôch

source: --no-autolaunch do not autolaunch applications
cs: --no-autolaunch neodstartovat automaticky spou¹tìné aplikace
fi: --no-autolaunch ‰l‰ k‰ynnist‰ sovelluksia automaattisesti
sk: --no-autolaunch nespú¹»a» automaticky aplikácie

source: --dont-restore do not restore saved session
cs: --dont-restore neobnovovat ulo¾ené sezení
fi: --dont-restore ‰l‰ palauta tallennettua istuntoa
sk: --dont-restore neobnovova» ulo¾ené sedenie

source: --locale locale locale to use
cs: --locale locale místnínastavení
fi: --locale locale k‰ytett‰v‰ maa-asetus
sk: --locale locale pou¾i» dané miestne nastavenia

source: --create-stdcmap create the standard colormap hint in PseudoColor visuals
cs: --create-stdcmap vytvoøit standardní barevnou paletu v pseudobarvách
sk: --create-stdcmap vytvori» ¹tandardnú mapu farieb v re¾imoch PseudoColor

source: --visual-id visualid visual id of visual to use
cs: --visual-id visualid èíslo obrazového módu(visual id), který bude pou¾it
fi: --visual-id visualid k‰ytett‰v‰n visualin id
sk: --visual-id visualid èíslo obrazového re¾imu

source: --static do not update or save configurations
cs: --static neobnovovat a neukládat konfigurace
fi: --static ‰l‰ p‰ivit‰ tai tallenna asetuksia
sk: --static neobnovova» ani neuklada» nastavenia

source: --no-polling do not periodically check for configuration updates
cs: --no-polling nekontrolovat periodicky konfiguraèní obnovení
sk: --no-polling nekontrolova» pravidelne zmenu konfigurácie

source: --synchronous turn on synchronous display mode
cs: --synchronous synchronizace vykreslování
fi: --synchronous synkroninen n‰yttˆtila p‰‰lle
sk: --synchronous zapnú» re¾im synchrónneho zobrazovania

source: --version print version and exit
cs: --version zobraz verzi a konec
fi: --version tulosta versio ja poistu
sk: --version vypí¹e verziu a ukonèí sa

source: --help show this message
cs: --help uka¾ tuto zprávu
fi: --help n‰yt‰ t‰m‰ viesti
sk: --help vypí¹e tento text

source: could not find user GNUstep directory (%s). Make sure you have installed Window Maker correctly and run wmaker.inst
cs: nelze najít u¾ivatelùv adresáø GNUstep (%s). Ujistìte se, ¾e máte Window Maker správnì nainstalován, pøípadnì spus»te wmaker.inst
fi: k‰ytt‰j‰n GNUstep-hakemistoa (%s) ei lˆydy. Tarkista, ett‰ olet asentanut Window Makerin oikein ja ajanut komennon wmaker.inst
sk: nemo¾no nájs» u¾ivateµov adresár GNUstep (%s). Uistite se, ¾e Window Maker je správne nain¹talovaný a spustite wmaker.inst

source: could not find user GNUstep directory (%s).
cs: nelze nalézt u¾ivatelský GNUstep adresáø (%s).
sk: nemo¾no nájs» u¾ívateµov GNUstep adresár (%s).

source: There was an error while creating GNUstep directory, please make sure you have installed Window Maker correctly and run wmaker.inst
cs: Do¹lo k chybì pøi vytváøení adresáøe GNUstep, prosím ujistìte se, ¾emáte Window Maker správnì nainstalován, pøípadnì spus»te wmaker.inst
sk: Pri vytváraní GNUstep adresára do¹lo k chybe. Prosím, uistite sa, èi je Window Maker správne nain¹talovaný a spustite wmaker.inst

source: %s directory created with default configuration.
cs: %s adresáø vytvoøen se standardní konfigurací.
sk: adresár %s vytvorený so ¹tandardnou konfiguráciou.

source: %s:could not execute initialization script
cs: %s:nelze provést inicializaèní skript
fi: %s:ei voi suorittaa alustusskripti‰
sk: %s:nemo¾no vykona» inicializaèný skript

source: %s:could not execute exit script
cs: %s:nelze provést ukonèovací skript
fi: %s:lopetusskriptin suoritus ei onnistu
sk: %s:nemo¾no vykona» závereèný skript

source: too few arguments for %s
cs: nedostatek argumetù pro %s
fi: liian v‰h‰n argumentteja %s:lle
sk: málo argumetov pre %s

source: bad value for visualid: "%s"
cs: chybná hodnota pro typ visual: "%s"
fi: v‰‰r‰ arvo visualid:lle: "%s"
sk: chybná hodnota obrazového re¾imu (visualid): "%s"

source: %s: invalid argument '%s'
cs: %s: chybný argument '%s'
fi: %s: virheellinen argumentti '%s'
sk: %s: nesprávny argument '%s'

source: Try '%s --help' for more information
cs: Zkuste '%s --help', získáte více informací.
fi: Saat lis‰tietoa kirjoittamalla '%s --help'
sk: Príkaz '%s --help' poskytne bli¾¹ie informácie

source: X server does not support locale
cs: X server nepodporuje nastavení místních zvyklostí
fi: X-palvelin ei tue maa-asetusta
sk: X server nepodporuje miestne nastavenia

source: cannot set locale modifiers
cs: nelze nastavit modifikátory místních zvyklostí
fi: maa-asetus-m‰‰reiden asetus ei onnistu
sk: nemo¾no nastavi» modifikátory miestnych nastavení

source: could not open display "%s"
cs: nelze otevøít displej "%s"
fi: n‰ytˆn "%s" avaus ei onnistu
sk: nemo¾no otvori» display "%s"

source: could not grab keyboard
cs: nelze snímat klávesnici
sk: nemo¾no grabova» klávesnicu

source: %s:could not stat menu
cs: %s:nelze provést operaci 'stat' na menu
sk: %s:nemo¾no získa» atribúty súboru s menu

source: could not stat() menu file '%s'
sk: nemo¾no získa» atribúty súboru s menu '%s'

source: could not find menu file '%s' referenced in WMRootMenu
sk: nemo¾no nájs» súbor s menu '%s', urèený vo WMRootMenu

source: could not find any usable menu files. Please check '%s'
sk: nemo¾no nájs» ¾iadne pou¾iteµné menu. Prosím, skontrolujte '%s'

source: using default menu file "%s" as the menu referenced in WMRootMenu could not be found
cs: pou¾itý soubor s menu "%s", odkazovaný z WMRootMenu není nalezen
fi: k‰ytet‰‰n oletusvalikkoa "%s", koska WMRootMenussa mainittua valikkoa ei lˆydy
sk: pou¾itý implicitný súbor s menu "%s", keï¾e nemo¾no nájs» menu urèené vo WMRootMenu

source: invalid content in menu file '%s'. It should either be a property list menu or the path to the file, enclosed in ".
sk: nesprávny obsah súboru s menu '%s'. Mal by obsahova» buï property list alebo cestu k súboru uzavretú medzi ".

source: could not define value for %s for cpp
cs: pro %s pro cpp nelze urèit hodnotu
fi: ei voitu m‰‰ritell‰ arvoa %s cpp:lle
sk: nemo¾no urèi» hodnotu %s pre cpp

source: could not get password entry for UID %i
cs: pro u¾ivatele s UID %i nelze získat heslo
fi: k‰ytt‰j‰n, jonka UID on %i, salasanamerkint‰‰ ei saatu
sk: nemo¾no získa» informácie o u¾ívateµovi s UID %i

source: your machine is misconfigured. HOSTNAME is set to %s
cs: vá¹ poèítaè není správnì konfigurován. Promìnná HOSTNAME je nastavena na %s
fi: koneesi on konfiguroity v‰‰rin. HOSTNAME on asetettu arvoon %s
sk: vá¹ systém nie je správne nakonfigurovaný. HOSTNAME má hodnotu %s

source: your machine is misconfigured. HOST is set to %s
cs: vá¹ poèítaè není správnì nakonfigurován. Promìnná HOST nastavena na %s
fi: koneesi on konfiguroity v‰‰rin. HOST on asetettu arvoon %s
sk: vá¹ systém nie je správne nakonfigurovaný. HOST má hodnotu %s

source: Program Arguments
cs: Argumenty programu
fi: Ohjelman argumentit
sk: Argumenty programu

source: Enter command arguments:
cs: Zadejte argumenty pro pøíkaz:
fi: Syˆt‰ komentoriviargumentit:
sk: Zadajte argumenty príkazu:

source: unable to get dropped data from DND drop
cs: nelze získat data z DND operace drop
fi: ved‰ ja tiputa -datan saanti ei onnistunut
sk: nemo¾no získat polo¾ené dáta DND operácie drop

source: error getting dropped data from DND drop
cs: chyba pøi získávání dat z operace DND drop
fi: virhe ved‰ ja tiputa -datan vastaanotossa
sk: chyba pri získavaní polo¾ených dát DND operácie drop

source: out of memory while getting data from DND drop
cs: nedostatek pamìti pøi ètení dat z DND operace drop
fi: muisti loppui vastaanotettaessa ved‰ ja tiputa -dataa
sk: nedostatok pamäti pri èítaní dát DND operácie drop

source: out of memory during expansion of "%s"
cs: nedostatek pamìti pøi expanzi "%s"
fi: muisti loppui "%s":n lavennuksen aikana
sk: nedostatok pamäti pri nahradzovaní "%s"

source: out of memory during expansion of "%w"
cs: nedostatek pamìti pøi expanzi "%w"
fi: muisti loppui "%w":n lavennuksen aikana
sk: nedostatok pamäti pri nahradzovaní "%w"

source: out of memory during expansion of "%W"
cs: nedostatek pamìti pøi expanzi "%s"
fi: muisti loppui "%W":n lavennuksen aikana
sk: nedostatok pamäti pri nahradzovaní "%W"

source: out of memory during expansion of "%a"
cs: nedostatek pamìti pøi expanzi "%a"
fi: muisti loppui "%a":n lavennuksen aikana
sk: nedostatok pamäti pri nahradzovaní "%a"

source: out of memory during expansion of "%d"
cs: nedostatek pamìti pøi expanzi "%d"
fi: muisti loppui "%d":n lavennuksen aikana
sk: nedostatok pamäti pri nahradzovaní "%d"

source: selection not available
cs: výbìr není dostupný
fi: valintaa ei ole saatavilla
sk: výber nie je dostupný

source: bad window name value in %s state info
cs: chybné jméno okna ve stavové informaci %s
fi: virheellinen ikkunan nimi tilatiedossa %s
sk: chybná hodnota názvu okna v informácii o stave %s

source: could not send message to background image helper
cs: nelze poslat zprávu umís»ovaèi pozadí
fi: viestin l‰hetys taustakuva-apurille ep‰onnistui
sk: nemo¾no posla» správu umiestòovaèu pozadia

source: could not load mask bitmap file "%s". Won't use mask
cs: nelze naèíst masku bitové mapy ze souboru "%s". Masky nebudou pou¾ity.
fi: maski-bittikarttatiedostoa "%s" ei voitu ladata. Maskia ei k‰ytet‰
sk: nemo¾no naèíta» súbor masky "%s". Maska sa nepou¾ije

source: could not parse color "%s"
cs: nelze zpracovat barvu "%s"
fi: v‰rin "%s" j‰sennys ei onnistunut
sk: nemo¾no spracova» farby "%s"

source: could not allocate color "%s"
cs: nelze alokovat polo¾ku pro barvu "%s"
fi: v‰rin "%s" varaus ei onnistunut
sk: nemo¾no alokova» farbu "%s"

source: Exit
cs: Konec
fi: Poistu
sk: Koniec

source: Exit window manager?
cs: Ukonèit mana¾era oken?
fi: Poistutaanko ikkunamanagerista?
sk: Ukonèi» mana¾ér okien?

source: Close X session
cs: Ukonèit sezení X
fi: Sulje X-istunto
sk: Ukonèit sedenie X systému

source: Close Window System session? Kill might close applications with unsaved data.
cs: Ukonèit sezení? Ukonèením aplikací mù¾e dojít ke ztrátì dat.
fi: Suljetaanko ikkunointij‰rjestelm‰n istunto? Tallentamatonta tietoa sis‰lt‰v‰t sovellukset saattavat sulkeutua.
sk: Ukonèi» sedenie systému okien? Núteným ukonèením aplikacií mô¾e dôjs» k strate dát.

source: Kill X session
cs: Ukonèit sezení X
fi: Sulje X-istunto
sk: Zabi» sedenie X systému

source: Kill Window System session? (all applications will be closed)
cs: Ukonèit sezení? (v¹echny aplikace budou uzavøeny)
fi: Tapetaanko ikkunointij‰rjestelm‰n istunto? (kaikki ohjelmat suljetaan)
sk: Nútene ukonèit sedenie systému okien? (v¹etky aplikácie budú ukonèené)

source: %s:invalid kbd shortcut specification "%s" for entry %s
cs: %s:chybná specifikace klávesové zkratky "%s" pro polo¾ku %s
fi: %s: virheellinen n‰pp‰inpikavalinnan m‰‰rittely "%s" merkinn‰lle %s
sk: %s:chybná klávesová skratka "%s" polo¾ky %s

source: %s:invalid key in shortcut "%s" for entry %s
cs: %s:chybná klávesa v klávesové zkratce "%s" pro polo¾ku %s
fi: %s: v‰‰r‰nlainen n‰pp‰in pikavalinnassa "%s" merkinn‰lle %s
sk: %s:chybná klávesa v klávesovej skratke "%s" polo¾ky %s

source: %s: unmatched '"' in menu file
cs: %s: neodpovídající '"' v souboru s menu
fi: %s: valikkotiedostosta ei lˆydy paria merkille '"'
sk: %s: nepriradené '"' v súbore s menu

source: %s: missing command
cs: %s: oèekávám pøíkaz
fi: %s: puuttuva komento
sk: %s: chýbajúci príkaz

source: invalid OPEN_MENU specification: %s
cs: chybná specifikace OPEN_MENU: %s
fi: virheellinen OPEN_MENU-m‰‰ritelm‰: %s
sk: chybne zadaný príkaz OPEN_MENU: %s

source: %s:could not stat menu:%s
cs: %s:nelze provést operaci 'stat' na menu:%s
sk: %s:nemo¾no získa» atribúty súboru s menu:%s

source: too many parameters in OPEN_MENU: %s
cs: pøíli¹ mnoho parametrù pro pøíkaz OPEN_MENU: %s
fi: liian monta parametria OPEN_MENUssa: %s
sk: priveµa parametrov pre príkaz OPEN_MENU: %s

source: There are more than one WORKSPACE_MENU commands in the applications menu. Only one is allowed.
cs: V aplikaèním menu je více ne¾ jeden pøíkaz WORKSPACE_MENU. Je povolen jen jeden.
fi: Sovellusvalikossa on enemm‰n kuin yksi WORKSPACE_MENU-komento. Vain yksi on sallittu.
sk: V aplikaènom menu je viac ne¾ jeden príkaz WORKSPACE_MENU. Povolený je len jeden.

source: There are more than one WINDOWS_MENU commands in the applications menu. Only one is allowed.
cs: V aplikaèním menu je více ne¾ jeden pøíkaz WORKSPACE_MENU. Je povolen jen jeden.
sk: V aplikaènom menu je viac ne¾ jeden príkaz WORKSPACE_MENU. Povolený je len jeden.

source: Window List
cs: Seznam oken
sk: Okná

source: %s:missing parameter for menu command "%s"
cs: %s:pro pøíkaz menu "%s" oèekávám parametr
fi: %s: puuttuva parametri valikkokomennolla "%s"
sk: %s:chýbajúci parameter pre príkaz menu "%s"

source: %s:unknown command "%s" in menu config.
cs: %s:neznámý pøíkaz "%s" v konfiguraci menu.
fi: %s: tuntematon komento "%s" valikkom‰‰ritelm‰ss‰.
sk: %s:neznámy príkaz "%s" v konfigurácii menu.

source: %s:can't add shortcut for entry "%s"
cs: %s: pro polo¾ku "%s" nelze pøidat klávesou zkratku
fi: %s: kohdalle "%s" ei voida lis‰t‰ pikavalintaa
sk: %s:nemo¾no priradi» klávesovú skratku polo¾ke "%s"

source: %s:maximal line size exceeded in menu config: %s
cs: %s:v konfiguraci menu %s byla pøekroèena maximální délka øádky
fi: %s: rivin maksimipituus ylitetty valikkom‰‰ritelm‰ss‰: %s
sk: %s:prekroèená maximálna då¾ka riadku v konfigurácii menu: %s

source: %s:missing command in menu config: %s
cs: %s:v konfiguraci menu %s oèekávám pøíkaz
fi: %s: komento puuttuu valikkom‰‰ritelm‰ss‰: %s
sk: %s:chýbajúci príkaz v konfigurácii menu: %s

source: %s:syntax error in menu file:END declaration missing
cs: %s:syntaktická chyba v souboru s menu: oèekávána deklarace END
fi: %s: virhe valikkotiedoston syntaksissa: END-m‰‰re puuttuu
sk: %s:syntaktická chyba v súbore s menu: chýbajúci príkaz END

source: could not make arguments for menu file preprocessor
cs: nelze vytvoøit argumety pro preprocesor souboru s menu
fi: ei voitu tehd‰ argumentteja valikkotiedoston esik‰sittelij‰lle
sk: nemo¾no vytvori» argumety pre preprocesor súboru s menu

source: %s:could not open/preprocess menu file
cs: %s: nelze otevøít nebo pøedzpracovat soubor s menu
fi: %s: valikkotiedostoa ei voitu avata/esik‰sitell‰
sk: %s:nemo¾no otvori» alebo predspracova» súbor s menu

source: %s:could not open menu file
cs: %s:nelze otevøít soubor s menu
fi: %s: valikkotiedoston avaus ei onnistunut
sk: %s:nemo¾no otvori» súbor s menu

source: %s:invalid menu file. MENU command is missing
cs: %s:syntaktická chyba v souboru s menu: oèekáván pøíkaz MENU
fi: %s:virheellinen valikkotiedosto. MENU-komento puuttuu.
sk: %s:syntaktická chyba v súbore s menu: chýbajúci príkaz MENU

source: error reading preprocessed menu data
cs: chyba pøi ètení pøedzpracovaného souboru s menu
fi: virhe luettaessa esik‰sitelty‰ valikkodataa
sk: chyba pri èítaní dát predspracovaného menu

source: %s:no title given for the root menu
cs: %s: pro hlavní menu nebyl urèen titulek
fi: %s: juurivalikolle ei ole annettu nime‰
sk: %s:hlavné menu nemá urèený názov

source: out of memory while constructing directory menu %s
cs: nedostatek pamìti pøi konstrukci menu z obsahu adresáøe %s
fi: muisti loppui luotaessa hakemistovalikkoa %s
sk: nedostatok pamäti pri vytváraní adresárového menu %s

source: %s:could not stat file "%s" in menu directory
cs: %s:nelze provést 'stat' na soubory "%s" v adresáøi s menu
fi: %s: tiedostolta "%s" ei saatu stat-tietoja valikkohakemistossa
sk: %s:nemo¾no získa» atribúty súboru "%s" v adresári menu

source: Commands
cs: Pøíkazy
fi: Komennot
sk: Príkazy

source: Restart
fi: K‰ynnist‰ uudelleen
sk: Re¹tart

source: Exit...
cs: Konec...
fi: Poistu...
sk: Koniec...

source: could not find menu file "%s" referenced in WMRootMenu
cs: nelze najít soubor s menu "%s", odkazovaný z WMRootMenu
fi: WMRootMenussa mainittua valikkotiedostoa "%s" ei lˆydy
sk: nemo¾no nájs» súbor s menu "%s", urèený vo WMRootMenu

source: could not access menu "%s" referenced in WMRootMenu
cs: není pøístup k souboru s menu "%s", odkazovaném z WMRootMenu
fi: WMRootMenussa mainittua valikkoa "%s" ei saada k‰yttˆˆn
sk: nemo¾no pristúpi» k menu "%s", urèenom vo WMRootMenu

source: %s:format error in root menu configuration "%s"
cs: %s:chybný formát v konfiguraci hlavního menu "%s"
fi: %s: muotoiluvirhe juurivalikon m‰‰rittelyss‰ "%s"
sk: %s:chybný formát v konfigurácii hlavného menu "%s"

source: The applications menu could not be loaded. Look at the console output for a detailed description of the errors.
cs: Menu aplikací nemù¾e být naèteno. Podívejte se na konzoli, bude tam detailní popis chyby.
fi: Sovellusvalikkoa ei voitu ladata. Saat virheist‰ tarkan kuvauksen katsomalla konsolitulostetta.
sk: Nemo¾no naèíta» menu aplikácií. Detailný popis chýb nájdete na výstupe konzoly.

source: could not initialize graphics library context: %s
cs: nelze inicializovat kontext grafické knihovny: %s
fi: grafiikkakirjastokontekstin %s alustus ei onnistunut
sk: nemo¾no inicializova» kontext grafickej kni¾nice: %s

source: could not do initialization of WINGs widget set
cs: nelze provést inicalizovat pøípravky WINGs
fi: WINGs-widget-setin alustus ei onnistunut
sk: nemo¾no inicializova» sadu widgetov WINGs

source: could not save session state in %s
cs: stav sezení nelze do %s ulo¾it
fi: istunnon tilan tallennus -> %s ei onnistunut
sk: nemo¾no ulo¾it sedenie do %s

source: can't convert "%s" to boolean
cs: "%s" nelze zkonvertovat na boolean
fi: "%s":‰‰ ei voida muuttaa boolean-tyyppiseksi
sk: nemo¾no previes» "%s" na boolean

source: out of memory while saving session state
cs: nedostatek pamìti pøi ukládání stavu sezení
fi: muisti loppui istunnon tilaa tallennettaessa
sk: nedostatok pamäti pri ukladaní sedenia

source: end of memory while saving session state
cs: nedostatek pamìti pøi ukládání stavu sezení
fi: muisti loppui istunnon tilaa tallennettaessa
sk: nedostatok pamäti pri ukladaní sedenia

source: connection to the session manager was lost
cs: pøipojení ke správci sezení bylo ztraceno
fi: yhteys istunnon manageriin menetettiin
sk: spojenie so správcom sedení sa stratilo

source: could not get window list!!
cs: nelze získat seznam oken!!!
fi: ikkunaluetteloa ei saatu!!
sk: nemo¾no získa» zoznam okien!!!

source: internal X error: %s
cs: interní chyba systému X: %s
fi: sis‰inen X-virhe: %s
sk: interná chyba X systému: %s

source: got signal %i (%s) - restarting
cs: pøijat signál %i (%s) - restartuji
fi: vastaanotettiin signaali %i (%s) - k‰ynnistet‰‰n uudelleen
sk: prijatý signál %i (%s) - re¹tart

source: got signal %i - restarting
cs: pøijat signál %i - restartuji
fi: vastaanotettiin signaali %i - k‰ynnistet‰‰n uudelleen
sk: prijatý signál %i - re¹tart

source: got signal %i (%s) - rereading defaults
cs: pøijat signál %i (%s) - obnovuji nastavení
sk: prijatý signál %i (%s) - znovunaèítanie nastavení

source: got signal %i - rereading defaults
cs: pøijat signál %i - obnovuji nastavení
sk: prijatý signál %i - znovunaèítanie nastavení
