Repository: glepore70/pronom-research
Catalog: sample_files/p/po/*.po
Languages: cs, fi, sk

source: got signal %i (%s) - exiting...
cs: pøijat signál %i (%s) - konec...
fi: vastaanotettiin signaali %i (%s) - poistutaan...
sk: prijatý signál %i (%s) - koniec...

source: got signal %i - exiting...
cs: pøijat signál %i - konec...
fi: vastaanotettiin signaali %i - poistutaan...
sk: prijatý signál %i - koniec...

source: got signal %i (%s)
cs: pøijat signál %i (%s)
fi: vastaanotettiin signaali %i (%s)
sk: prijatý signál %i (%s)

source: got signal %i
cs: získán signál %i
fi: vastaanotettiin signaali %i
sk: signál %i

source: crashed while trying to do some post-crash cleanup. Aborting immediatelly.
cs: pøi úklidu po neoèekávané chybe do¹lo opìt k této chybì. Okam¾itý konec.
fi: kaatui, kun yritettiin tehd‰ kaatumisen j‰lkeist‰ siivousta. Keskeytet‰‰n v‰littˆm‰sti.
sk: havária pri pokuse uprata» po predchádzajúcej havárii. Okam¾itý koniec.

source: trying to restart Window Maker...
cs: pokou¹ím se restartovat Window Maker...
fi: yritet‰‰n k‰ynnist‰‰ Window Maker uudelleen...
sk: re¹tart Window Makeru...

source: trying to start alternate window manager...
cs: zkou¹ím odstartovat alternativní okenní mana¾er
fi: yritet‰‰n k‰ynnist‰‰ vaihtoehtoista ikkunamanageria...
sk: spustenie alternatívneho mana¾éru okien...

source: failed to start alternate window manager. Aborting.
cs: alternativního správce oken nelze odstartovat. Konec.
fi: vaihtoehtoisen ikkunamanagerin k‰ynnistys ep‰onnistui. Keskeytet‰‰n.
sk: nepodarilo sa spusti» alternatívny mana¾ér okien. Koniec.

source: a fatal error has occured, probably due to a bug. Please fill the included BUGFORM and report it.
cs: fatální chyba, pravdìpodobnì chyba ve Window Makeru. Prosím vyplòte soubor BUGFORM(anglicky) a po¹lete ho.
fi: vakava virhe on tapahtunut - luultavasti bugin johdosta. Ole hyv‰ ja t‰yt‰ oheinen bugi-kaavake ja l‰het‰ se.
sk: fatálna chyba nastala pravdepodobne v dôsledku chyby vo Window Makery. Prosím, vyplòte a po¹lite prilo¾ený BUGFORM.

source: icon size is configured to %i, but it's too small. Using 16, instead
cs: je nakonfigurována velikost ikony %i, to je ov¹em málo. Pou¾iji 16
fi: kuvakkeiden kooksi on s‰‰detty %i, mutta se on liian pieni. K‰ytet‰‰n sen sijaan kokoa 16.
sk: veµkos» ikony je nastavená na %i, ale to je málo. Pou¾je sa 16

source: XKB is not supported. KbdModeLock is automatically disabled.
cs: XKB není podporován. KbdModeLock byl automaticky vypnut.
fi: XKB:t‰ ei tueta. KbdModeLockin k‰yttˆ estet‰‰n automaattisesti.
sk: roz¹írenie XKB nie je podporované. KbdModeLock je automaticky zakázaný.

source: it seems that there is already a window manager running
cs: mám ten pocit, ¾e zde ji¾ jeden mana¾er oken bì¾í
fi: n‰ytt‰‰ silt‰, ett‰ jokin ikkunamanageri on jo k‰ynniss‰
sk: zdá sa, ¾e mana¾ér okien u¾ be¾í

source: could not manage screen %i
cs: nelze spravovat obrazovku %i
fi: ruudun %i k‰sittely ei onnistu
sk: nemo¾no spravova» obrazovku %i

source: could not manage any screen
cs: nelze spravovat ¾ádnou obrazovku
fi: mink‰‰n ruudun k‰sittely ei onnistu
sk: nemo¾no spravova» ¾iadnu obrazovku

source: Windows
cs: Okna
fi: Ikkunat
sk: Okná

source: image file "%s" used as texture could not be found.
cs: soubor s obrázkem "%s" pou¾itým v textuøe nebyl nalezen.
fi: kuviona k‰ytetty‰ kuvatiedostoa "%s" ei lˆydy.
sk: súbor s obrázkom "%s" pou¾itým ako textúra nemo¾no nájs».

source: could not load texture pixmap "%s":%s
cs: nelze naèíst obrázek s texturou: "%s":%s
fi: kuvio-kuvakarttaa "%s":%s ei lˆydy
sk: nemo¾no naèíta» textúru "%s":%s

source: library "%s" cound not be opened.
cs: nelze otevøít knihovnu "%s".
fi: kirjaston "%s" avaus ei onnistunut.
sk: nemo¾no otvori» kni¾nicu "%s".

source: function "%s" not found in library "%s"
cs: funkce "%s" nebyla v knihovnì "%s" nalezena
fi: funktiota "%s" ei lˆytynyt kirjastosta "%s"
sk: funkciu "%s" nemo¾no nájs» v kni¾nici "%s"

source: function textures not supported on this system, sorry.
cs: textury vytváøené funkcemi nejsou na tomto systému podporovány. Sorry.
fi: t‰m‰ j‰rjestelm‰ ei valitettavasti tue kuviofunktioita.
sk: funkèné textúry na tomto systéme nie sú podporované.

source: could not allocate image buffer
cs: nelze alokovat pamì» pro obrázek
fi: Kuvapuskurin varaus ep‰onnistui
sk: nemo¾no alokova» pamä» pre obrázok

source: could not find icon file "%s"
cs: nelze získat soubor s ikonou "%s"
fi: kuvaketiedostoa "%s" ei lˆytynyt
sk: nemo¾no nájs» súbor s ikonou "%s"

source: the NumLock, ScrollLock or similar key seems to be turned on. Turn it off or some mouse actions and keyboard shortcuts will not work.
cs: Klávesa NumLock, ScrollLock nebo podobná je zøejmì zapnuta.. Vypnìte ji, nebo nìkteré akce my¹i a klávesové zkratky nebudou fungovat.
fi: NumLock, ScrollLock tai muu samantapainen n‰pp‰in n‰ytt‰‰ olevan p‰‰ll‰. Laita se pois, tai jotkut hiiritoiminnot ja n‰pp‰inpikavalinnat eiv‰t toimi.
sk: NumLock, ScrollLock alebo podobná klávesa je zrejme zapnutá. Vypnite ju, lebo niektoré akcie my¹i a klávesové skratky nebudú fungova».

source: This will kill the application. Any unsaved changes will be lost. Please confirm.
cs: Aplikace bude takto ukonèena. Jakékoli zmìny budou ztraceny. Potvrïte prosím.
fi: T‰m‰ sulkee ohjelman v‰kisin. Kaikki tallentamattomat muutokset menetet‰‰n. Vahvista.
sk: Aplikácia bude nútene ukonèená. Akékoµvek zmeny budú stratené. Prosím potvrïte.

source: Set Shortcut
cs: Nastavit zkratku
fi: Aseta pikavalinta
sk: Nastavi» skratku

source: could not create submenu for window menu
cs: nelze vytvoøit submenu pro menu oken
fi: ikkunavalikkoon ei voitu luoda alivalikkoa
sk: nemo¾no vytvori» submenu pre menu okna

source: Keep on top
cs: V¾dy navrchu
fi: Pid‰ p‰‰llimm‰isen‰
sk: V¾dy navrchu

source: Keep at bottom
cs: Dr¾et dole
fi: Pid‰ alimmaisena
sk: V¾dy naspodu

source: Shade
cs: Titulek
fi: Vain otsikkopalkki
sk: Zrolova»

source: Resize/Move
cs: Zvìt¹it/Pøesunout
fi: Muuta kokoa/Siirr‰
sk: Veµkos»/Presun

source: Select
cs: Vybrat
fi: Valitse
sk: Vybra»

source: Attributes...
cs: Atributy...
fi: Ominaisuudet...
sk: Nastavenia...

source: Options
cs: Volby
fi: Valintoja
sk: Mo¾nosti

source: Unshade
cs: Celé okno
fi: Myˆs sis‰ltˆ
sk: Vyrolova»

source: Could not find icon "%s" specified for this window
cs: Pro toto okno nelze najít specifikovanou ikonu (%s)
fi: T‰lle ikkunalle m‰‰ritelty‰ kuvaketta "%s" ei lˆytynyt
sk: Nemo¾no nájs» ikonu "%s" nastavenú pre toto okno.

source: Could not open specified icon "%s":%s
cs: Nelze otevøít specifikovanou ikonu "%s":%s
fi: Ei voinut avata m‰‰ritelty‰ kuvaketta "%s":%s
sk: Nemo¾no otvori» danú ikonu "%s":%s

source: Inspecting %s.%s
cs: Nastavení pro %s.%s
sk: Atribúty %s.%s

source: Click in the window you wish to inspect.
cs: Kliknìte na okno, které chcete provìøit.
fi: Paina ikkunaa, jota haluat tarkastella.
sk: Kliknite na okno, ktorého vlastnosti chcete upravi».

source: The configuration will apply to all windows that have their WM_CLASS property set to the above selected name, when saved.
cs: Konfigurace bude aplikována na v¹echny klienty, kteøí mají nastavenu vlastnost WM_CLASS na vý¹e vybranou (pøi ulo¾ení této konfigurace)
fi: Kun asetukset tallennetaan, ne vaikuttavat kaikkiin ikkunoihin, joiden WM_CLASS-ominaisuus on asetettu yll‰ valituksi nimeksi.
sk: Konfigurácia bude pou¾itá pre v¹etky okná, ktoré majú vlastnos» WM_CLASS nastavenú na hodnotu uvedenú vy¹¹ie.

source: Save
cs: Ulo¾it
fi: Tallenna
sk: Ulo¾i»

source: Apply
cs: Nastavit
fi: Toteuta
sk: Pou¾i»

source: Reload
cs: Obnovit
fi: Lataa uudelleen
sk: Obnovi»

source: Window Specification
cs: Specifikace okna
fi: Ikkunan m‰‰rittely
sk: Urèenie okna

source: Window Attributes
cs: Atributy okna
fi: Ikkunan ominaisuudet
sk: Nastavenia okna

source: Advanced Options
cs: Dal¹í volby
fi: Tarkemmat asetukset
sk: Roz¹írené mo¾nosti

source: Icon and Initial Workspace
cs: Ikona a poèáteèní plocha
fi: Kuvake ja alustava tyˆtila
sk: Ikona a poèiatoèná plocha

source: Application Specific
cs: Atributy aplikace
fi: Sovelluskohtaiset
sk: ©pecifické pre aplikáciu

source: Defaults for all windows
cs: Standard pro v¹echna okna
fi: Kaikkien ikkunoiden oletusarvot
sk: Implicitné pre v¹etky okná

source: Select window
cs: Vyberte okno
sk: Vybra» okno

source: Attributes
cs: Atributy
fi: Ominaisuudet
sk: Nastavenia

source: Disable titlebar
cs: Zakázat titulek
sk: Odstráni» hornú li¹tu

source: Remove the titlebar of this window. To access the window commands menu of a window without it's titlebar, press Control+Esc (or the equivalent shortcut, if you changed the default settings).
cs: Odstranit titulkový pruh tohoto okna. Abyste pøesto mohli pou¾ívat pøíkazové menu okna bez titulkového pruhu, stisknìte Control+Esc (nebo ekvivalentní zkratku, jestli¾e jste zmìnili výchozí nastavení).
fi: Poista t‰m‰n ikkunan otsikkopalkki. P‰‰set otsikkopalkittoman ikkunan komentovalikkoon painamalla Control+Esc (tai vastaavaa pikavalintaa, jos muutit oletusasetuksia).
sk: Odstráni» hornú li¹tu tohto okna. Prístup k príkazom menu okna bez hornej li¹ty umo¾òuje kombinácia kláves Control+Esc (alebo iná klávesová skratka, ak ste zmenili implicitné nastavenia).

source: Disable resizebar
cs: Zakázat zvìt¹ovací rù¾ek
sk: Odstráni» spodnú li¹tu

source: Remove the resizebar of this window.
cs: Odstranit zvìt¹ovací rù¾ek tohoto okna.
fi: Poista t‰m‰n ikkunan koons‰‰tˆpalkki.
sk: Odstráni» spodnú li¹tu tohto okna, ktorá slú¾i na zmenu veµkosti okna.

source: Disable close button
cs: Zakázat prvek pro uzavøení
sk: Odstráni» tlaèidlo Zatvori»

source: Remove the `close window' button of this window.
cs: Odstranit zavírací tlaèítko tohoto okna.
fi: Poista t‰m‰n ikkunan 'sulje ikkuna'-painike.
sk: Odstráni» z tohto okna tlaèidlo Zatvori» okno.

source: Disable miniaturize button
cs: Zakázat prvek pro minimalizaci
sk: Odstráni» tlaèidlo Minimalizova»

source: Remove the `miniaturize window' button of the window.
cs: Odstranit minimalizaèní tlaèítko tohoto okna.
fi: Poista t‰m‰n ikkunan 'pienenn‰ ikkuna'-painike.
sk: Odstráni» z tohto okna tlaèidlo Minimalizova» okno.

source: Disable border
cs: Zakázat okraje
sk: Odstráni» okraj

source: Remove the 1 pixel black border around the window.
cs: Odstranit jednopixelový èerný okraj okolo okna.
fi: Poista ikkunan ymp‰rilt‰ 1 pikselin levyinen musta reuna.
sk: Odstráni» èierny okraj (hrubý 1 bod) okolo okna

source: Keep on top (floating)
cs: V¾dy navrch / plovoucí
sk: V¾dy navrchu

source: Keep the window over other windows, not allowing them to cover it.
cs: Dr¾et okno nad ostatními a zabránit jim v pøekryvu.
sk: Dr¾a» okno v¾dy nad ostatnými, a nedovoli», aby ho prekryli.

source: Keep at bottom (sunken)
cs: Dr¾et vespod
sk: V¾dy naspodu

source: Keep the window under all other windows.
cs: Dr¾et okno pod v¹emi ostatními.
fi: Pid‰ ikkuna kaikkien muiden ikkunoiden alla.
sk: Dr¾a» okno pod v¹etkými ostatnými.

source: Make window present in all workspaces.
cs: Zobrazit okno na v¹ech plochách.
sk: Zobrazova» okno na v¹etkých plochách.

source: Start miniaturized
cs: Odstartovat jako ikonu
sk: Spusti» minimalizované

source: Make the window be automatically miniaturized when it's first shown.
cs: Automaticky minimalizovat okno, kdy¾ se uká¾e poprvé.
fi: Pienenn‰ ikkuna automaattisesti, kun se n‰ytet‰‰n ensimm‰isen kerran.
sk: Automaticky minimalizova» okno pri jeho prvom zobrazení.

source: Start maximized
cs: Odstartovat jako velké okno
sk: Spusti» maximalizované

source: Make the window be automatically maximized when it's first shown.
cs: Automaticky maximalizovat okno, kdy¾ se uká¾e poprvé.
fi: Suurenna ikkuna automaattisesti, kun se n‰ytet‰‰n ensimm‰isen kerran.
sk: Automaticky maximalizova» okno pri jeho prvom zobrazení.

source: Full screen maximization
cs: Maximalizace na plnou obrazovku
sk: Maximalizova» na celú obrazovku

source: Make the window use the whole screen space when it's maximized. The titlebar and resizebar will be moved to outside the screen.
cs: Nechat okno pou¾ívat celou obrazovku v maximalizovaném stavu. Titulkový pruh a zvìt¹ovací rù¾ek budou pøesunuty mimo obrazovku.
fi: Aseta ikkuna k‰ytt‰m‰‰n koko ruutualaa, kun se on suurennettu. Otsikko- ja koonmuutospalkki siirret‰‰n ruudun ulkopuolelle.
sk: Pou¾i» pri maximalizácii celú plochu obrazovky. Horná a spodná li¹ta budú mimo obrazovky.

source: Advanced
cs: Dal¹í volby
fi: Tarkemmat asetukset
sk: Roz¹írené

source: Do not bind keyboard shortcuts
cs: Klávesnice jen pro aplikaci
sk: Ignorova» klávesové skratky

source: Do not bind keyboard shortcuts from Window Maker when this window is focused. This will allow the window to receive all key combinations regardless of your shortcut configuration.
cs: Nepou¾ívat klávesové zkratky Window Makeru, je-li toto okno zamìøeno. Umo¾ní vám to, aby toto okno pøijalo v¹echny klávesové kombinace bez ohledu na va¹e nastavení klávesových zkratek.
fi: ƒl‰ sido Window Makerin n‰pp‰inpikavalintoja, kun t‰m‰ ikkuna on aktiivinen. T‰m‰ sallii ikkunan vastaanottaa kaikki n‰pp‰inyhdistelm‰t pika- valinta-asetuksistasi riippumatta.
sk: Ignorova» klávesové skratky Window Makeru, keï je okno zamerané. To umo¾ní oknu prijíma» v¹etky kombinácie kláves bez ohµadu na va¹e nastavenia klávesových skratiek.

source: Do not bind mouse clicks
cs: My¹ jen pro aplikaci
sk: Ignorova» akcie my¹i

source: Do not bind mouse actions, such as `Alt'+drag in the window (when alt is the modifier you haveconfigured).
cs: Pro okno nepou¾ívat akce my¹i jako napø. 'Alt'+táhni (s my¹í:), je-li alt modifikátorem, který jste si nastavili.
fi: ƒl‰ sido ikkunassa hiiritoimintoja kuten 'Alt'-siirtoja (kun alt on m‰‰rittelem‰si modifier).
sk: Ignorova» akcie my¹i ako napr. Alt+»ahanie v okne (ak je Alt vá¹ nastavený modifikátor).

source: Do not show in the window list
cs: Vynechat ze seznamu oken
sk: Nezobrazova» v zozname okien

source: Do not list the window in the window list menu.
cs: Nevypisovat okno do seznamu oken.
fi: ƒl‰ n‰yt‰ kyseist‰ ikkunaa ikkunalista-valikossa.
sk: Nezaradi» okno do menu Okná.

source: Do not let it take focus
cs: Nepovolit zamìøení
sk: Zakáza» aktivovanie

source: Do not let the window take keyboard focus when you click on it.
cs: Nepovolit oknu získat zamìøení, kdy¾ na nìho kliknete.
fi: ƒl‰ anna ikkunalle syˆttˆkohdistusta, kun napautat hiirell‰ sen alueella.
sk: Zakáza» oknu aktivovanie pri kliknutí alebo prechode my¹ou nad ním.

source: Keep inside screen
cs: Dr¾et uvnitø obrazovky
sk: V¾dy vnútri obrazovky

source: Do not allow the window to move itself completely outside the screen. For bug compatibility.
cs: Nepovolit oknu kompletní pøesun mimo obrazovku. (kvùli chybové kompatibilitì)
fi: ƒl‰ anna ikkunan siirty‰ kokonaan ruudun ulkopuolelle. Bugi-yhteensopivuuden takia.
sk: Nedovoli» presunutie celého okna mimo obrazovky.

source: Ignore 'Hide Others'
cs: Ignorovat "Skrýt ostatní"
sk: Ignorova» Skry» ostatné

source: Do not hide the window when issuing the `HideOthers' command.
cs: Neskrývat okno pøi pøíkazu 'Skrýt ostatní'.
fi: ƒl‰ piilota ikkunaa, kun annetaan 'Piilota muut'-komento.
sk: Neskrýva» okno pri príkaze Skry» ostatné

source: Ignore 'Save Session'
cs: Neukládat stav sezení
sk: Ignorova» Ulo¾i» sedenie

source: Do not save the associated application in the session's state, so that it won't be restarted together with other applications when Window Maker starts.
cs: Neukládat pøidru¾enou aplikaci do stavu sezení, aby nebyla restartována s ostatními aplikacemi pøi startu Window Makeru.
fi: ƒl‰ tallenna ks. sovellusta istunnon tilaan, jotta sit‰ ei k‰ynnistet‰ uudelleen muiden sovellusten kanssa, kun Window Maker k‰ynnistyy.
sk: Neuklada» príslu¹nú aplikáciu pri ukladaní sedenia, tak¾e tá nebude automaticky spustená pri ïal¹om ¹tarte Window Makeru.

source: Emulate application icon
cs: Emulovat aplikaèní ikonu
sk: Emulova» ikonu aplikácie

source: Make this window act as an application that provides enough information to Window Maker for a dockable application icon to be created.
cs: Donutit toto okno, aby se chovalo jako aplikace, která poskytuje dostatek informací pro Window Maker, aby mohla být vytvoøena ukotvitelná aplikaèní ikona.
fi: Laita t‰m‰ ikkuna k‰ytt‰ytym‰‰n sovelluksena, joka tarjoaa Window Makerille tarpeeksi informaatiota, jotta voidaan luoda telakoituva sovelluskuvake.
sk: Umo¾ni» tomuto oknu správa» sa ako aplikácia, ktorá Window Makeru poskytuje dostatok informácií na vytvorenie ukotviteµnej ikony aplikácie.

source: Disable language button
cs: Zakázat tlaèítko jazyka
sk: Odstráni» tlaèidlo Jazyk

source: Remove the `toggle language' button of the window.
cs: Odstranit tlaèítko pøepnutí jazyka z tohoto okna.
fi: Poista ikkunan 'vaihda kielt‰'-painike.
sk: Odstráni» z okna tlaèidlo Prepínanie jazykov.

source: Miniwindow Image
cs: Ikona miniokna
fi: Kuvake
sk: Ikona miniokna

source: Icon filename:
cs: Soubor ikony:
sk: Súbor ikony:

source: Ignore client supplied icon
cs: Ignorovat klientovy ikony
fi: ƒl‰ k‰yt‰ sovelluksen antamaa
sk: Ignorova» ikonu poskytnutú klientom

source: Initial Workspace
cs: Poèáteèní plocha
fi: Tyˆtila k‰ynnistett‰ess‰
sk: Poèiatoèná plocha

source: The workspace to place the window when it'sfirst shown.
cs: Plocha, kam umístit okno pøi prvním ukázání.
fi: Tyˆtila, johon ikkuna sijoitetaan, kun se n‰ytet‰‰n ensimm‰isen kerran.
sk: Plocha, na ktorú sa umiestni okno pri prvom zobrazení.

source: Nowhere in particular
cs: Neurèena
fi: Ei erityist‰ tilaa
sk: ¥ubovoµná

source: Application Attributes
cs: Atributy aplikace
sk: Aplikácia

source: Start hidden
cs: Startovat skrytì
sk: Pri ¹tarte skry»

source: Automatically hide application when it's started.
cs: Automaticky skrýt aplikaci pøi startu.
fi: Piilota sovellus automaattisesti, kun se k‰ynnistet‰‰n.
sk: Automaticky skry» aplikáciu pri ¹tarte.

source: No application icon
cs: Bez aplikaèní ikony
sk: Zakáza» ikonu aplikácie

source: Disable the application icon for the application. Note that you won't be able to dock it anymore, and any icons that are already docked will stop working correctly.
cs: Zakázat aplikaèní ikonu pro tuto aplikaci. Uvìdomte si ale, ¾e ji nebudete moci více ukotvit do doku a v¹echny ji¾ ukotvené ikony pøestanou správnì pracovat.
fi: Poista sovelluksen sovelluskuvake. Huomaa, ett‰ et voi en‰‰ telakoida sit‰, ja jo telakoidut kuvakkeet lakkaavat toimimasta oikein.
sk: Zakáza» ikonu aplikácie. Nebudete ju môc» ukotvi» a ikony, ktoré sú u¾ ukotvené prestanú správne fungova».

source: Shared application icon
sk: Zdieµa» ikonu aplikácie

source: Use a single shared application icon for all of the instances of this application.
sk: Pou¾i» jedinú zdieµanú ikonu aplikácie pre v¹etky in¹tancie tejto aplikácie.

source: out of memory while updating wm hints
sk: nedostatok pamäti pri obnovovaní príznakov wm

source: Workspace %i
cs: Plocha %i
fi: Tyˆtila %i
sk: Plocha %i

source: Workspaces
cs: Pracovní plochy
fi: Tyˆtilat
sk: Pracovné plochy

source: could not create Workspace menu
cs: nelze vytvoøit menu pracovních ploch
fi: Tyˆtilavalikon luonti ei onnistunut
sk: nemo¾no vytvori» menu Pracovné plochy

source: New
cs: Nová
fi: Uusi
sk: Nová

source: Destroy Last
cs: Zru¹it poslední
fi: Tuhoa viimeinen
sk: Odstráni» poslednú

source: Collapse
cs: Svinout
fi: H‰ivyt‰

source: Uncollapse
cs: Rozvinout
fi: H‰ivytys pois

source: Info
cs: Informace

source: Legal
cs: Licenèní podmínky
fi: K‰yttˆehdot

source: Collapse application icons
cs: Zakázat více aplikaèních ikon
fi: H‰ivyt‰ sovelluskuvakkeet

source: Collapse application icons from other instances of this application into one.
cs: Zru¹ aplikaèní ikony ostatních instancí aplikace a pou¾ívej pouze aplikaèní ikonu tohoto okna.
fi: H‰ivyt‰ t‰m‰n sovelluksen muiden esiintymien sovellusikonit yhdeksi.

source: unterminated string
fi: terminoimaton merkkijono

source: unterminated array
fi: terminoimaton taulukko

source: missing , in array or unterminated array
fi: taulukosta puuttuu pilkku tai taulukkoa ei ole terminoitu

source: could not get array element
fi: taulukon alkiota ei saatu

source: unterminated dictionary
fi: terminoimaton hakemisto

source: missing dictionary key
fi: hakemistoavain puuttuu

source: missing dictionary entry key or unterminated dictionary
fi: sanakirja-avain puuttuu tai sanakirjaa ei ole terminoitu

source: error parsing dictionary key
fi: virhe sanakirja-avainta j‰sennett‰ess‰

source: missing = in dictionary entry
fi: sanakirjamerkinn‰st‰ puuttuu =

source: missing ; in dictionary entry
fi: Sanakirjamerkinn‰st‰ puuttuu ;

source: was expecting a string, dictionary, data or array. If it's a string, try enclosing it with ".
fi: odotettiin merkkijonoa, sanakirjaa, dataa tai taulukkoa. Jos kyseess‰ on merkkijono, kokeile laittaa se lainausmerkkeihin.

source: Comments are not allowed inside WindowMaker owned domain files.
fi: Kommentit eiv‰t ole sallittuja Window Makerille kuuluvissa tiedostoissa.

source: could not open domain file %s
fi: domain-tiedoston %s avaus ei onnistunut

source: extra data after end of file
fi: ylim‰‰r‰ist‰ dataa tiedoston lopun per‰ss‰
